
  {
    "requirements": [
      {
        "country": "Afghanistan",
        "consulate": "Delhi",
        "visaType": "Business",
        "data": {
          "requirements": [
            "Valid Passport with at least 6 months validity from the date of travel",
            "1 form",
            "2 Recent Coloured photos",
            "Cover letter",
            "Invitation letter",
            "Current year DAR copy"
          ]
        }
      },
      {
        "country": "Albania",
        "consulate": "Delhi",
        "visaType": "Business",
        "data": {
        "requirements": [
            "BUSINESS Visa Requirements for ALBANIA (DELHI)",
            "No Embassy in India",
            "Note: Visa to Albania is NOT issued in India.",
            "For travel to Albania, the applicant needs to check with the invitee in Albania for the visa requirements and formalities etc.",
            "OR must personally apply for Albania visa from China by going there.",
            "Disclaimer:",
            "* Applicants to check themselves for COVID related travel advisory/guidelines before their travel.",
            "* Jetsave only facilitates visa related process and shall not bear any liability for any travel disruption or inconvenience if caused during the travel.",
            "* Although our team takes very special care in updating visa requirements onto our website, possibility of human errors cannot be ruled out.",
            "* Many a times, Embassies/Consulates change the visa requirements without any notice or publications and we come across such changes only after we apply for the respective visas. Hence, there may be some delay in website update for such cases.",
            "* In case of any discrepancy in visa requirements on our website we request you to please highlight and oblige us. Partners like you are the most critical component of our success. Thank you."
          ]
        }
      },
      {
        "country": "Algeria",
        "consulate": "Delhi",
        "visaType": "Business",
        "data": {
          "requirements": [
            "BUSINESS Visa Requirements for ALGERIA (DELHI)",
            "Applied through VFS",
            "Kindly check visa application centers/embassy website for latest visa requirements and quarantine rules, as they change frequently without any intimation.",
            "Original Passport with a validity at least six (06) months.",
            "Two (02) copies of Visa Application Forms, dully and fully completed, typed online, and signed. Original signature is required on each page.",
            "Two (02) recent passport size photographs.",
            "Original invitation letter from Algerian company which should be submitted in hard copy, attested by the Algerian Chamber of Commerce.",
            "Copy of confirmed hotel reservation and copy of airfare ticket showing dates of entry and exit.",
            "Copy of valid travel insurance.",
            "Letter of responsibility typewritten on the company letterhead is required and must be addressed to: Embassy of Algeria, Visa Section, 2/2, Shanti Niketan, New Delhi, 110021, India.",
            "The letter must explain all of the following -",
            "Nature of business to be performed.",
            "Name and address of reference to be visited in Algeria.",
            "The letter should be signed by an officer of the company other than the applicant.",
            "Note: Hotel confirmation is not required if invitation letter mentions that the inviting company shall take care of the accommodation of the traveller and mentions the complete address of the stay in Algeria.",
            "Fees:",
            "Rs. 8100/- For Single Entry(30 days).",
            "Rs. 9700/- For multiple entry(90 days)",
            "VFS service charges Rs. 1600/- (VFS charges to be paid by cash)",
            "The visa fees must be paid in `INR` only through Bank Demand Drafts payable to - `Embassy of Algeria in New Delhi`.",
            "Applicant or Applicant's Company name is required to be mentioned on the Demand draft as a Purchaser name. For this, the DD should be made from Applicant`s Bank account or Company`s Bank account only. Travel Agents/Representatives purchaser name demand drafts are not acceptable.",
            "Processing Time: Min. 7 Working Days.",
            "NOTE: Please note that above is only an indicative processing time which is based on the current trend. Actual processing time may vary and is at sole discretion of the Visa Consular of the Embassy/Consulate.",
            "Submission Days: Monday to Friday",
            "Disclaimer:",
            "* Applicants to check themselves for COVID related travel advisory/guidelines before their travel.",
            "* Jetsave only facilitates visa related process and shall not bear any liability for any travel disruption or inconvenience if caused during the travel.",
            "* Although our team takes very special care in updating visa requirements onto our website, possibility of human errors cannot be ruled out.",
            "* Many a times, Embassies/Consulates change the visa requirements without any notice or publications and we come across such changes only after we apply for the respective visas. Hence, there may be some delay in website update for such cases.",
            "* In case of any discrepancy in visa requirements on our website we request you to please highlight and oblige us. Partners like you are the most critical component of our success. Thank you."
          ]
        }
      }
    ]
  }
